[
  {
    "company": "Prevalent AI",
    "company_location": "Kakkanad, India",
    "role": "Security Analyst - L2",
    "team": "Client Delivery",
    "time_duration": "Jul 2024 – Present",
    "details": [
      {
        "title": "Detection Engineering \\& Investigation Enablement",
        "description": "Developed 30+ detection, investigation, and reporting use cases using Splunk and SQL to support SOC analysts with improved alert clarity and actionable security insights."
      },
      {
        "title": "Security Telemetry Correlation",
        "description": "Unified and normalized endpoint, vulnerability, and cloud security telemetry from Wiz, CrowdStrike, Qualys, Tenable, Tanium, and Rapid7 across 5+ environments to support threat detection and analysis workflows."
      },
      {
        "title": "Security Data Processing Pipelines",
        "description": "Built fault-tolerant Python and SQL-based pipelines to ingest, enrich, and structure ~1TB/month of security telemetry used for detection logic, investigation context, and analytics."
      },
      {
        "title": "SOC \\& Onboarding Support",
        "description": "Supported SOC and onboarding teams by troubleshooting ingestion, parsing, and schema issues, ensuring high-quality telemetry availability for downstream investigations."
      },
      {
        "title": "Detection Tuning \\& Alert Quality Improvement",
        "description": "Collaborated with SOC teams to validate alerts, reduce false positives by 15\\%, and improve detection efficiency by enhancing enrichment logic and correlation rules."
      },
      {
        "title": "Recognition",
        "description": "Received the Ka PAI Award for delivering reliable and scalable security data workflows that improved detection readiness and analyst efficiency."
      }
    ]
  },
  {
    "company": "Prevalent AI",
    "company_location": "Kakkanad, India",
    "role": "Security Analyst - L1",
    "team": "Client Delivery",
    "time_duration": "Jul 2022 – Jul 2024",
    "details": [
      {
        "title": "Detection Use Case Development",
        "description": "Developed 20+ security detection and analytics use cases to support SOC operations and improve visibility into suspicious activity across client environments."
      },
      {
        "title": "Multi-Source Telemetry Analysis",
        "description": "Onboarded and correlated data from EDR, vulnerability management, cloud, and identity sources to support alert generation and investigation workflows."
      },
      {
        "title": "Security Tool Integrations",
        "description": "Delivered REST API integrations for security platforms such as CrowdStrike, Tenable, and Tanium, ensuring reliable data ingestion for SOC monitoring and analysis."
      },
      {
        "title": "Data Enrichment \\& Contextual Support",
        "description": "Implemented enrichment logic adding asset, location, and business context to alerts, enabling faster triage and improved investigation decision-making."
      },
      {
        "title": "Alert Noise Reduction",
        "description": "Improved alert signal quality by implementing deduplication, correlation, and suppression logic, reducing false positives by 12\\% across multiple pipelines."
      },
      {
        "title": "Operational Reliability",
        "description": "Recognized for consistent delivery and reliability in maintaining telemetry quality and detection readiness for SOC teams."
      }
    ]
  }
]